app/controllers/busca_controller.rb

  def search
    @posts = Post.all
    @posts = @posts.where("dev LIKE ? OR description LIKE ?", "%#{params[:search]}%", "%#{params[:search]}%") if params[:search].present?
    @posts = @posts.where(status: params[:status]) if params[:status] != 'todos'
    @posts = @posts.where(good_bad: params[:good_bad]) if params[:good_bad] != 'todos'

    if params[:start_date].present? && params[:end_date].present?
      start_date = Date.parse(params[:start_date])
      end_date = Date.parse(params[:end_date])
      @posts = @posts.where(date: start_date..end_date)
---
SELECT "posts".* FROM "posts" WHERE (dev LIKE '%phill%' OR description LIKE '%phill%')
SELECT "posts".* FROM "posts" WHERE "posts"."status" = ?  [["status", "continuar"]]
SELECT "posts".* FROM "posts" WHERE "posts"."status" = ? AND "posts"."good_bad" = ?  [["status", "Continuar"], ["good_bad", "Todos"]]
SELECT "posts".* FROM "posts" WHERE "posts"."date" BETWEEN ? AND ?  [["date", "2023-07-22"], ["date", "2023-07-22"]]