app/controllers/posts_controller.rb

INSERT INTO "posts" ("dev", "description", "date", "status", "good_bad", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    ActiveRecord::Base.transaction do
      post_params[:sub_posts_attributes].each do |sub_post_params|
        @post = Post.create!(sub_post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 17]]
---
  def destroy
    @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find(params[:id])